export const termsOfService = `제1조 (목적)
본 약관은 콘텐츠 오디세이(이하 "회사")가 제공하는 모든 서비스(이하 "서비스")의 이용조건 및 절차, 이용자와 회사의 권리, 의무, 책임사항 및 서비스 이용에 관한 기타 필요한 사항을 규정함을 목적으로 합니다.

제2조 (약관의 효력 및 변경)
1. 본 약관은 서비스 화면에 게시하거나 기타의 방법으로 이용자에게 공지함으로써 효력이 발생합니다.
2. 회사는 필요한 경우 관련법령을 위배하지 않는 범위에서 본 약관의 내용을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지함으로써 효력이 발생합니다.
3. 이용자는 변경된 약관에 대해 거부할 권리가 있으며, 거부 의사를 명확히 한 경우 회사는 당해 이용자에게 변경된 약관의 내용을 적용할 수 없습니다. 다만, 이용자가 명시적으로 거부 의사를 표시하지 않고 서비스를 계속 이용하는 경우에는 변경된 약관에 동의한 것으로 간주합니다.

제3조 (약관 외 준칙)
본 약관에 명시되지 않은 사항에 대해서는 관계 법령 또는 상관례에 따릅니다.

제4조 (이용계약의 성립)
1. 이용계약은 이용자의 이용 신청에 대한 회사의 이용 승낙과 이용자의 본 약관 내용에 대한 동의로 성립합니다.
2. 이용계약에 대한 동의는 서비스 신청 시 본 약관을 읽고 "동의합니다" 버튼을 클릭함으로써 이루어집니다.

제5조 (서비스 이용 신청)
1. 서비스 이용을 위한 신청은 서비스의 회원 가입 양식에 따라 필요한 정보를 기입하여 제출함으로써 이루어집니다.
2. 모든 회원은 실제 정보를 제공해야 하며, 허위의 정보를 제공할 경우 얻은 서비스의 이익을 상실하고, 관련 법령에 따라 처벌을 받을 수 있습니다.

제6조 (이용자 정보의 변경)
회원은 등록된 자신의 정보가 변경되었을 경우, 즉시 온라인으로 수정을 하거나 이메일 등의 방법으로 회사에 그 변경 사항을 알려야 합니다.

제7조 (개인정보보호 의무)
회사는 이용자의 정보 수집 시 서비스 제공에 필요한 범위에서 최소한의 정보를 수집합니다. 또한, 수집된 개인정보는 당해 이용자의 동의 없이 목적 외의 용도로 사용하거나 제3자에게 제공하지 않습니다. 단, 법률에 의거하거나 수사 목적의 경우는 예외로 합니다.`

export const privacyPolicy = `제1조 (목적)
본 동의서는 콘텐츠 오디세이(이하 "회사")가 제공하는 디지털 컨텐츠 및 관련 서비스(이하 "서비스")의 이용과 관련하여, 회사가 이용자의 개인정보를 어떻게 수집, 이용, 관리하는지에 대한 내용을 명시함으로써, 이용자의 권리를 보호하고, 개인정보와 관련된 이용자의 이해를 돕기 위해 마련되었습니다.

제2조 (수집하는 개인정보의 항목)
회사는 서비스 제공을 위하여 필요한 최소한의 개인정보만을 수집합니다. 수집하는 개인정보의 항목은 다음과 같습니다.
1. 회원가입 시 수집항목: 이메일 주소, 비밀번호, 닉네임, 프로필 사진(선택 사항)
2. 서비스 이용 과정에서 수집할 수 있는 정보: 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보
3. 결제 시 수집항목: 신용카드 정보, 은행 계좌 정보, 결제기록 (단, 이는 결제 처리를 위한 외부 결제업체에서 주로 처리)

제3조 (개인정보의 수집 및 이용 목적)
회사는 수집한 개인정보를 다음의 목적을 위해 활용합니다.
1. 회원 관리: 회원제 서비스 이용에 따른 본인 확인, 개인식별, 가입 의사 확인, 회원자격 유지·관리, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인
2. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산: 콘텐츠 제공, 맞춤 서비스 제공, 물품 또는 서비스 구매 및 요금 결제, 금융 거래 본인 인증 및 금융 서비스
3. 마케팅 및 광고에 활용: 신규 서비스(제품) 개발 및 특화, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계

제4조 (개인정보의 보유 및 이용 기간)
회사는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.
1. 보존 항목: 회원가입 정보(이메일, 비밀번호, 닉네임 등)
2. 보존 근거: 서비스 이용의 혼선 방지, 불법 행위 기록 보관
3. 보존 기간: 회원 탈퇴 시까지
그 외 서비스 이용 과정에서 생성된 정보는 내부 방침 또는 관련 법령의 규정에 의하여 일정 기간 저장`

export const provideService = `제1조 (목적)
본 약관은 콘텐츠 오디세이(이하 "회사")가 제공하는 모든 디지털 콘텐츠 및 관련 서비스(이하 "서비스")의 이용과 관련하여, 회사와 이용자 간의 권리, 의무 및 책임사항, 서비스 이용조건 및 절차, 기타 필요한 사항을 규정함을 목적으로 합니다.

제2조 (정의)

1. "이용자"란 회사의 서비스에 접속하여 본 약관에 따라 회사가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
2. "회원"이라 함은 회사에 개인정보를 제공하여 회원등록을 한 자로서, 회사의 정보를 지속적으로 제공받으며, 회사가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
3. "비회원"이라 함은 회원에 가입하지 않고 회사가 제공하는 서비스를 이용하는 자를 말합니다.

제3조 (서비스의 제공 및 변경)
1. 회사는 다음과 같은 서비스를 제공합니다.
- 디지털 콘텐츠(영상, 음악, 문서 등)의 제공
- 사용자 커뮤니티 운영
- 회원 간의 커뮤니케이션 및 정보공유
- 기타 회사가 정하는 서비스
2. 회사는 운영상, 기술상의 필요에 따라 제공하는 서비스의 내용을 변경할 수 있으며, 이 경우에는 변경될 서비스의 내용 및 제공일자를 명시하여 현재의 서비스 내용을 게시하는 위치에 사전에 공지합니다.
3. 서비스 변경 내용이 중대하거나 이용자에게 불리한 변경인 경우에는 서비스를 이용하는 이용자에게 이메일 등을 통해 통지합니다.

제4조 (서비스의 중단)
1. 회사는 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
2. 회사는 제1항의 사유로 서비스 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대하여 배상하지 않습니다. 단, 회사가 고의 또는 중대한 과실이 없는 한 그 책임을 지지 않습니다.
3. 장기간의 서비스 중단이 필요한 경우 회사는 이용자에게 사전 통지하며, 불가피한 사유로 사전 통지가 어려운 경우 가능한 빠른 시간 내에 통지합니다.`